{
  "name": "@bentley/imodeljs-frontend",
  "entries": [
    {
      "version": "1.0.0",
      "tag": "@bentley/imodeljs-frontend_v1.0.0",
      "date": "Mon, 03 Jun 2019 18:09:39 GMT",
      "comments": {
        "none": [
          {
            "comment": "RPC system now accepts only basic values (primitives, \"interface\" objects, and binary)."
          },
          {
            "comment": "Updated release tags. "
          },
          {
            "comment": "added Viewport.changeViewedModel2d"
          },
          {
            "comment": "Clip shape tool should only set AccuDraw rotation on 1st point."
          },
          {
            "comment": "#123874 Fix a prompt. #123731 Clip from element change to ignore selection set containing clip transient."
          },
          {
            "comment": "Combine planar classifier textures to converve texture units"
          },
          {
            "comment": "Removed MaybeRenderApp and WebGLTestContext from tests"
          },
          {
            "comment": "Remove unnecessary comment and initialization checks from tests"
          },
          {
            "comment": "Fix bug sending sync ToolSettings message to UI when tool did not want ToolSettings."
          },
          {
            "comment": "Support emphasize of isolated elements. Allow default appearance independent of emphasize."
          },
          {
            "comment": "Dont enforce front/back ratio when displaying map as it does not require z-Buffer."
          },
          {
            "comment": "Export the classes from WebMercatorTileTree"
          },
          {
            "comment": "Fix contentRange when GLTF contains RTC"
          },
          {
            "comment": "Fix assertion when computing range of instanced meshes."
          },
          {
            "comment": "Fix loader so that it doesn't attempt to load .css files that don't exist."
          },
          {
            "comment": "Fix background map tile when child not found."
          },
          {
            "comment": "Allow ^ to be used to define angle degrees."
          },
          {
            "comment": "Downgraded certain NotificationManager methods to @beta to question styling support"
          },
          {
            "comment": "Fix erroneous clipping of instanced geometry."
          },
          {
            "comment": "constructors for BeButtonEvent classes now take props argument"
          },
          {
            "comment": "Remove back face culling option due to lack of performance benefit and other observations"
          },
          {
            "comment": "Increase precision of clipping by transforming clip planes off the GPU."
          },
          {
            "comment": "Change ModifyElementSource to internal."
          },
          {
            "comment": "Added onActiveClipChanged event to ViewClipDecorationProvider instead of having to implement ViewClipEventHandler. Support for named clips using SettingsAdmin (needs integration tests)."
          },
          {
            "comment": "Saved clip integration tests. Change view rotate wheel to only zoom about target center when displayed."
          },
          {
            "comment": "Support multipass rendering for planar classification for computers that down support multi-target framebuffers"
          },
          {
            "comment": "Refactored and simplified implementation of IModelDb.open"
          },
          {
            "comment": "83505"
          },
          {
            "comment": "Reduce display performance degradation when non-convex clip shapes are applied to a view."
          },
          {
            "comment": "Added Overflow button support"
          },
          {
            "comment": "PropertyRecord can now optionally have `extendedData` which is a map of `any`"
          },
          {
            "comment": "Add support for synchronous quantity parsing and showing and hiding InputFieldMessages."
          },
          {
            "comment": "Set max tiles to skip to 1 for reality model tiles. (better user experience)"
          },
          {
            "comment": "Set release tags for TiledGraphicsProvider classes"
          },
          {
            "comment": "Reload tile tree if animation id changes"
          },
          {
            "comment": "Removed use of OidcClientWrapper. "
          },
          {
            "comment": "Add cSpell comment."
          },
          {
            "comment": "Rename terrain to backgroundMap."
          },
          {
            "comment": "Add IModelApp.queryRenderCompatibility() API to allow querying of any rendering limitations of a client system."
          },
          {
            "comment": "Retire some tile-related feature gates."
          },
          {
            "comment": "Add ability to save/restore toolsetting properties during a session."
          },
          {
            "comment": "Change to using the new SharedSettings API."
          },
          {
            "comment": "Added test for shareClip."
          },
          {
            "comment": "Add slope biasing to solar shadow mapping."
          },
          {
            "comment": "Reduce horizon limit so that shadows appear earlier and later."
          },
          {
            "comment": "Reduced delay between opening a viewport and seeing any graphics."
          },
          {
            "comment": "Don't await tentative as it can prevent being able to double click to fit."
          },
          {
            "comment": "Change to the way the background map is specified, to allow overlays."
          },
          {
            "comment": "Introduced tile format v4.0"
          },
          {
            "comment": "Tool writers only need AccuDrawHintBuilder, AccuDraw should be internal."
          },
          {
            "comment": "use HTMLElements for tooltips"
          },
          {
            "comment": "Improve touch cursor visibility. Fix tap on canvas decoration when touch cursor is active."
          },
          {
            "comment": "loader finds and loads css files in production mode."
          }
        ]
      }
    },
    {
      "version": "0.191.0",
      "tag": "@bentley/imodeljs-frontend_v0.191.0",
      "date": "Mon, 13 May 2019 15:52:05 GMT",
      "comments": {
        "none": [
          {
            "comment": "Support spatial classification of context reality models."
          },
          {
            "comment": "API methods for adding and removing context reality models"
          },
          {
            "comment": "Account for view clip in adjustZPlanes. Fit view needs to check clipVolume ViewFlag."
          },
          {
            "comment": "Increase ambient light to .2"
          },
          {
            "comment": "Adds parameter for api-extractor to validate missing release tags"
          },
          {
            "comment": "Eliminate display performance issue caused by normal matrix computation."
          },
          {
            "comment": "remove requirement that JavaScript classnames match BIS classnames"
          },
          {
            "comment": "Reduce the number of geocoordination requests produced when loading map tiles."
          },
          {
            "comment": "Save ClipVector on ViewState instead of always creating new one from json."
          },
          {
            "comment": "Set initial GL state to match default"
          },
          {
            "comment": "Dispose of planar classifiers."
          },
          {
            "comment": "Add spatial classifier UX "
          },
          {
            "comment": "Hide clip decoration during modify. Easier right-click/touch tap support for non-handle pickable decoration."
          },
          {
            "comment": "Add orientation option button to toolsettings for ClipByPlane/ClipByShape tools."
          },
          {
            "comment": "ConvexClipPlaneSet modify handles. Make EmphasizeElements internal."
          },
          {
            "comment": "ClipShape modify handles."
          },
          {
            "comment": "Fix clip to element tool. wip: Compute clp plane offset in world to support tool settings to enter distance."
          },
          {
            "comment": "#114939 Fix handle drag test. Support smart lock wth clip shape tool. Offset all clip planes w/shift."
          },
          {
            "comment": "View clip fixes and start of tools."
          },
          {
            "comment": "Fit view support for planes clip primitive. View clipping tools."
          },
          {
            "comment": "Fix tolerance multiplier for reality models"
          },
          {
            "comment": "Cull geometry outside view clipping volume before drawing."
          },
          {
            "comment": "Fix root tile range on webmercator tile tree for ground bias."
          },
          {
            "comment": "Added support for disabling certain capabilities for performance testing"
          },
          {
            "comment": "Adding support for readPixels performance testing"
          },
          {
            "comment": "Prevent tooltip from blocking tool event loop."
          },
          {
            "comment": "add test coverage in frontend"
          },
          {
            "comment": "Debug json clip plane usage."
          },
          {
            "comment": "ClipVector and ClipUtilities test and enhancements"
          },
          {
            "comment": "Add backface culling feature to improve performance."
          },
          {
            "comment": "Continue showing old skybox until new is ready"
          },
          {
            "comment": "Add method to return available reality models excluding attached."
          },
          {
            "comment": "Allow a view to define a set of elements which should never be drawn in that view."
          },
          {
            "comment": "Allow selected viewport to be changed when filterViewport rejects view."
          },
          {
            "comment": "Support instanced geometry."
          },
          {
            "comment": "Support clipping view volume with multiple convex clipPlane sets."
          },
          {
            "comment": "Fix rare failure to refine tiles displayed in view resulting in missing geometry."
          },
          {
            "comment": "Fix display of animated edges."
          },
          {
            "comment": "fixes for release tags"
          },
          {
            "comment": "When loading a perspective view, fix up potentially bad camera settings."
          },
          {
            "comment": "Reduce mininum front clip (Defect 103868)."
          },
          {
            "comment": "Ensure webgl resources allocated by clip volumes are properly released."
          },
          {
            "comment": "Fix broken links"
          },
          {
            "comment": "LoggerCategory -> FrontendLoggerCategory"
          },
          {
            "comment": "Fix IModelJsLoader to load imodeljs-markup only when needed"
          },
          {
            "comment": "Export solar calculations for UI"
          },
          {
            "comment": "Fix scenario in which lower-resolution tiles would be inappropriately substituted for tiles of appropriate resolution."
          },
          {
            "comment": "Fix multipass depth issue"
          },
          {
            "comment": "Fixed visual artifacts when drawing large batches of polylines."
          },
          {
            "comment": "Handle non-rds tile tree URLS when signed in."
          },
          {
            "comment": "Fix issue in which tiles of incorrect LOD would be drawn."
          },
          {
            "comment": "Fix issue with undo/redo view not having render materials"
          },
          {
            "comment": "Fixes to web mercator. "
          },
          {
            "comment": "Interfaces used by PropertyRecord are set to either beta or alpha as modules that use them to implement UI are not finalized."
          },
          {
            "comment": "eliminate depedency on JavaScript class names for EnityState subclasses"
          },
          {
            "comment": "Add support for appending GeoJson to existing IModel"
          },
          {
            "comment": "Use default background map type if an invalid type is specified in JSON."
          },
          {
            "comment": "Ensure queries for large numbers of subcategories are paged appropriately."
          },
          {
            "comment": "Improve graphics performance in Firefox."
          },
          {
            "comment": "Only use instancing optimization if the system supports instancing."
          },
          {
            "comment": "update Sprite after it is loaded"
          },
          {
            "comment": "Introduce LoggerCategory enum to advertise logger categories used by this package."
          },
          {
            "comment": "Logging fixes. "
          },
          {
            "comment": "Put sourcemap in npm package."
          },
          {
            "comment": "documentation cleanup"
          },
          {
            "comment": "add SVG to ImageSourceFormat"
          },
          {
            "comment": "add imodeljs-markup"
          },
          {
            "comment": "added vpDiv between parent and canvas"
          },
          {
            "comment": "Allow a view's extent limits to be overridden."
          },
          {
            "comment": "#108055 Update measure distance tooltip on click. Improve total distance visibility."
          },
          {
            "comment": "Add alpha tags to PropertyEditorParams interfaces that are not ready for public use."
          },
          {
            "comment": "Improved performance of multipass rendering"
          },
          {
            "comment": "#96348 Improve default rotate point for navigation cube"
          },
          {
            "comment": "Fixes to OidcBrowserClient. "
          },
          {
            "comment": "Optimize frontend renderer's performance by minimizing allocations of float arrays passed to the GPU."
          },
          {
            "comment": "Add more discrete, efficient Viewport synchronization events."
          },
          {
            "comment": "Added the ability to override category visibility on a per-model basis."
          },
          {
            "comment": "Rework projection of planar classifiers"
          },
          {
            "comment": "Refactor classification  rename to SpatialClassification"
          },
          {
            "comment": "Remove \"assembly lock\" from SelectTool now that SelectionScope has been implemented."
          },
          {
            "comment": "remove IModelApp subclasses"
          },
          {
            "comment": "Remove IModelConnection.openStandalone and IModelConnection.closeStandalone"
          },
          {
            "comment": "Setup a generic context for tracking client requests, and made various related enhancements to logging, usage tracking and authorization. "
          },
          {
            "comment": "Allow tile content to be requested without edge data, reducing tile size and download time."
          },
          {
            "comment": "Support image textures larger than WebGL capabilities by resizing them."
          },
          {
            "comment": "Update icons-generic-webfont version to latest available."
          },
          {
            "comment": "Update the ToolSettings properties defined in the Select Tool so two groups of options are presented, one for selection method and one for selection mode."
          },
          {
            "comment": "Simplify SelectTool SelectionMethod and SelectionMode."
          },
          {
            "comment": "Remove need to sync SelectionMethod since it is not changed within tool code."
          },
          {
            "comment": "Add IModelConnection.openSnapshot/closeSnapshot, deprecate IModelConnection.openStandalone/closeStandalone"
          },
          {
            "comment": "Refactor solar shadow settings - make these 3d only."
          },
          {
            "comment": "Support solar shadow display."
          },
          {
            "comment": "Make sky sphere / sky gradient use separate rendering primitive from sky cube."
          },
          {
            "comment": "don't draw Sprite before it is loaded"
          },
          {
            "comment": "Unit tests and fixed ColorEditor alignment"
          },
          {
            "comment": "Fix errors on Linux caused by case-sensitivity and shader optimizations."
          },
          {
            "comment": "Upgrade TypeDoc dependency to 0.14.2"
          },
          {
            "comment": "Update the primitive types to be within a Primitives namespace."
          },
          {
            "comment": "allow IModelApp subclass to override applicationId & applicationVersion"
          },
          {
            "comment": "revert static inheritance in IModelApp.ts"
          },
          {
            "comment": "wrap applicationId & applicationVersion in IModelApp"
          },
          {
            "comment": "Changes to build process to put all JavaScript files in version-specific subdirectories to avoid browser caching problems when deploying new versions."
          },
          {
            "comment": "view undo only saves changes to ViewState, not categories, models, or diplayStyle"
          },
          {
            "comment": "Clip tool changes now that undo/redo does not affect clipping. Right-click menu support for clip handles."
          },
          {
            "comment": "only save viewing volume for view undo rather than cloning ViewState"
          },
          {
            "comment": "Tools to create and modify view clip."
          },
          {
            "comment": "VSTS#114189 Reality data shown as Model and picker"
          },
          {
            "comment": "World decorations ignore symbology overrides defined for the view."
          }
        ]
      }
    },
    {
      "version": "0.190.0",
      "tag": "@bentley/imodeljs-frontend_v0.190.0",
      "date": "Thu, 14 Mar 2019 14:26:49 GMT",
      "comments": {
        "none": [
          {
            "comment": "Add ColorEditor to list of available Type Editors including new ColorParams to specify set of colors."
          },
          {
            "comment": "#73219 FitViewTool enhancement to fit to isolated elements or clip volume."
          },
          {
            "comment": "Supply additional statistics for monitoring tile requests."
          },
          {
            "comment": "Resolve transparency rendering error in multi-pass compositor due to way textures are bound."
          },
          {
            "comment": "Cleaned up documentation related to the display system."
          },
          {
            "comment": "use bubble-up for keyboard events"
          },
          {
            "comment": "Plugin Enhancements"
          },
          {
            "comment": "Documentation for Skybox"
          },
          {
            "comment": "Added vertex handles for line/arrow markup."
          }
        ]
      }
    },
    {
      "version": "0.189.0",
      "tag": "@bentley/imodeljs-frontend_v0.189.0",
      "date": "Wed, 06 Mar 2019 15:41:22 GMT",
      "comments": {
        "none": [
          {
            "comment": "add ios oidc client"
          },
          {
            "comment": "geometry-core camel case"
          },
          {
            "comment": "Add Selection Scope toolsettings to SelectTool."
          },
          {
            "comment": "allow subclasses of Range to use static methods"
          },
          {
            "comment": "Raise events when a Viewport's always- or never-drawn element sets change."
          },
          {
            "comment": "OIDC changes needed for Angular client"
          },
          {
            "comment": "Changes package.json to include api-extractor and adds api-extractor.json"
          },
          {
            "comment": "#66826 Default SelectTool to select all members of the selected element's assembly."
          },
          {
            "comment": "Default scope to element."
          },
          {
            "comment": "Use new buildIModelJsBuild script"
          },
          {
            "comment": "Generalize support for reading tiles to include tiles generated for Bimium."
          },
          {
            "comment": "AxisAlignedBox and ElementAlignedBox are now typed to Range3d rather than classes"
          },
          {
            "comment": "clone methods are no longer generic"
          },
          {
            "comment": "Optimize renderer to elide debug-only code paths unless explicitly enabled."
          },
          {
            "comment": "Generalize 3d tile support.   Handle transform on child nodes."
          },
          {
            "comment": "Avoid using cutting planes while animating if not displayed, completely hidden or completely visible."
          },
          {
            "comment": "Started work on webworker to decode jpeg files for GLTF"
          },
          {
            "comment": "Defer Draco support until moved to web worker"
          },
          {
            "comment": "Reduce memory consumption when ambient occlusion is disabled."
          },
          {
            "comment": "Fix incorrect colors for some decoration graphics."
          },
          {
            "comment": "Remove unneeded typedoc plugin dependency"
          },
          {
            "comment": "Add support for Draco compressed meshes"
          },
          {
            "comment": "Change drag select to exclude non locatable"
          },
          {
            "comment": "noMotion doesn't need to call beginDynamicUpdate"
          },
          {
            "comment": "example code (in comments) for frustum interpolator"
          },
          {
            "comment": "Consistent naming of \"get\" methods in Growable arrays."
          },
          {
            "comment": "Add EmphasizeElements to/from wire format methods"
          },
          {
            "comment": "Draw non-emphasized elements in \"fade-out\", non-locatable mode."
          },
          {
            "comment": "Move neverDrawn/alwaysDrawn to Viewport they are not part of the persistent ViewState. Change Viewport.addFeatureOverrides to an interface."
          },
          {
            "comment": "Rework and simplify ecef transform for reality models."
          },
          {
            "comment": "Correct ID for loading classifier trees."
          },
          {
            "comment": "Fix clipping volume being inconsistently applied to view."
          },
          {
            "comment": "Dont make textures transparent unless technique enables it."
          },
          {
            "comment": "Fix incorrect \"fit view\" behavior when empty tiles exist."
          },
          {
            "comment": "Handle relative subpaths in reality model tile trees.  Handle Y for axis/ "
          },
          {
            "comment": "Fix handling of null animation visibility - should be 100% not 0."
          },
          {
            "comment": "Added spatial <-> cartographic methods that check/use the geographic coordinate system before using ecef location."
          },
          {
            "comment": "DefaultViewTouchTool should not call handleEvent until it's installed as the active ViewTool."
          },
          {
            "comment": "Traverse GLTF node structure rather than meshes so that node transforms are used correctly."
          },
          {
            "comment": "Ensure viewport updates immediately when background map settings are changed."
          },
          {
            "comment": "Add a test to determine if GCS is present before using GCS converter."
          },
          {
            "comment": "Documentation improvements"
          },
          {
            "comment": "Support instanced rendering of .i3dm 3D tiles."
          },
          {
            "comment": "Preliminary support for drawing instanced geometry."
          },
          {
            "comment": "Fix branch transform for animation correctly - back out incorrect fix to BranchState."
          },
          {
            "comment": "Implemented, then commented out, doing jpeg decompression in a web worker"
          },
          {
            "comment": "added markup mode"
          },
          {
            "comment": "events are now on ScreenViewport.parentDiv rather than canvas"
          },
          {
            "comment": "update for geometry GrowableXYArray usage."
          },
          {
            "comment": "Measure Distance - change selected segment hilite. Measure Location - WIP use ecef transform."
          },
          {
            "comment": "More ui-framework unit tests"
          },
          {
            "comment": "Make it possible to define editor params for default Type Editors not explicitly specified by name."
          },
          {
            "comment": "Fixed a bug which caused non-locatable geometry to be rendered when no other symbology was overridden."
          },
          {
            "comment": "Defer loading of edges until needed"
          },
          {
            "comment": "Omit animation branches that are not visible."
          },
          {
            "comment": "Improve efficiency and completeness of SubCategory loading for ViewStates."
          },
          {
            "comment": "Save BUILD_SEMVER to globally accessible map. PluginAdmin and Plugin classes defined. IModelJsLoader improved."
          },
          {
            "comment": "add optional iModel argument to EntityState.clone "
          },
          {
            "comment": "added GeometricModelState.queryModelRange"
          },
          {
            "comment": "Added creatorId, new method to list RD per project, identified numerous area for changes WIP"
          },
          {
            "comment": "IModelConnection.close() always disposes the briefcase held at the backend in the case of ReadWrite connections. "
          },
          {
            "comment": "Implemented spatial criterai when searching through all reality data associated to a project."
          },
          {
            "comment": "Problem with root document of reality data not in root of blob. Tiles could not be fetched. Root path is added to tiles names."
          },
          {
            "comment": "Threading issue accessing Reality Data, RealityData class was transformed to be the main data access object instead of the client that was used by most/all reality data causing cache data clash and mix between many reality data."
          },
          {
            "comment": "Optimze containment test with spheres."
          },
          {
            "comment": "Move the IModelUnitTestRpcInterface into the testbed and out of the public AP"
          },
          {
            "comment": "Retry tile requests on time-out."
          },
          {
            "comment": "Remove loadNativeAsset and formatElements RPC calls from the IModelReadRpcInterface"
          },
          {
            "comment": "Removed IModelConnection.connectionId, added IModelApp.sessionId"
          },
          {
            "comment": "make view transition animations smoother"
          },
          {
            "comment": "Optimizations to tile format and schedule animation."
          },
          {
            "comment": "Tile requests can optionally specify a retryInterval."
          },
          {
            "comment": " Cleanup of DefaultToolSetting provider and EnumButtonGroup editor including new EditorParams."
          },
          {
            "comment": "Move property definitions to imodeljs-frontend so they could be used by tools to define properties for tool settings. Add toolsettings to Select Tool."
          },
          {
            "comment": "Added a new property to PropertyRecord - links."
          },
          {
            "comment": "IModelConnection.connectionTimeout is public to allow application customization."
          },
          {
            "comment": "upgrade to TypeScript 3.2.2"
          }
        ]
      }
    },
    {
      "version": "0.188.0",
      "tag": "@bentley/imodeljs-frontend_v0.188.0",
      "date": "Wed, 16 Jan 2019 16:36:09 GMT",
      "comments": {
        "none": [
          {
            "comment": "Report unsigned measure distance deltas."
          },
          {
            "comment": "Add batch id to schedule scripts"
          },
          {
            "comment": "Add batchID to schedule scripts"
          },
          {
            "comment": "Handle wider variety of GLTF bounding boxes etc."
          }
        ]
      }
    },
    {
      "version": "0.187.0",
      "tag": "@bentley/imodeljs-frontend_v0.187.0",
      "date": "Tue, 15 Jan 2019 15:18:59 GMT",
      "comments": {}
    },
    {
      "version": "0.186.0",
      "tag": "@bentley/imodeljs-frontend_v0.186.0",
      "date": "Mon, 14 Jan 2019 23:09:10 GMT",
      "comments": {
        "none": [
          {
            "comment": "Fix visible seams between map tiles."
          }
        ]
      }
    },
    {
      "version": "0.185.0",
      "tag": "@bentley/imodeljs-frontend_v0.185.0",
      "date": "Fri, 11 Jan 2019 18:29:00 GMT",
      "comments": {
        "none": [
          {
            "comment": "Optimize performance of schedule animation."
          },
          {
            "comment": "Use QuantityType.Coordinate for measure distance start/end points."
          },
          {
            "comment": "Add QuantityTypes LatLong and Coordinate."
          }
        ]
      }
    },
    {
      "version": "0.184.0",
      "tag": "@bentley/imodeljs-frontend_v0.184.0",
      "date": "Thu, 10 Jan 2019 22:46:17 GMT",
      "comments": {
        "none": [
          {
            "comment": "Add support for general 3d tilesets"
          },
          {
            "comment": "Fix drag select decorator when cursor moves out of view. Doc fixes."
          },
          {
            "comment": "Support region bounding volumes"
          },
          {
            "comment": "Fix IModelJsLoader to ensure react loaded before bwc."
          },
          {
            "comment": "MeasureLocationTool show lat/long and altitude."
          },
          {
            "comment": "Make raster text locate behave better."
          },
          {
            "comment": "Removed default OIDC scopes. All applications must now explicitly pass the required scopes. "
          },
          {
            "comment": "Can now await result from QuantityFormatter. Report delta relative to ACS when context lock enabled. Cleanup \"Measure.Points\" plug-in example until real measure tools are available."
          },
          {
            "comment": "Quantity formatter now allows async method to get FormatterSpec that can be used to format quantities."
          },
          {
            "comment": "QuantityFormatter.formatQuantity is now the only method to format quantities."
          },
          {
            "comment": "Rename formatQuantityWithSpec to formatQuantity"
          },
          {
            "comment": "Added ToolAdmin method for undo/undo last data button and call from Ctrl+Z."
          }
        ]
      }
    },
    {
      "version": "0.183.0",
      "tag": "@bentley/imodeljs-frontend_v0.183.0",
      "date": "Mon, 07 Jan 2019 21:49:21 GMT",
      "comments": {
        "none": [
          {
            "comment": "Add ambient occlusion to the display frontend system."
          },
          {
            "comment": "Account for global origin when reporting coordinates."
          },
          {
            "comment": "Add measure distance tool, will be moved to plug-in later."
          },
          {
            "comment": "Fixed unnecessary reload during OIDC redirect callback."
          }
        ]
      }
    },
    {
      "version": "0.182.0",
      "tag": "@bentley/imodeljs-frontend_v0.182.0",
      "date": "Mon, 07 Jan 2019 13:31:34 GMT",
      "comments": {
        "none": [
          {
            "comment": "When the iModel covers a large enough area, get the corners of background map tiles using Geographic reprojection"
          }
        ]
      }
    },
    {
      "version": "0.181.0",
      "tag": "@bentley/imodeljs-frontend_v0.181.0",
      "date": "Fri, 04 Jan 2019 13:02:40 GMT",
      "comments": {
        "none": [
          {
            "comment": "Fix incorrect display of point strings containing duplicate points."
          },
          {
            "comment": "Optimize performance when reading depth buffer."
          }
        ]
      }
    },
    {
      "version": "0.180.0",
      "tag": "@bentley/imodeljs-frontend_v0.180.0",
      "date": "Wed, 02 Jan 2019 15:18:23 GMT",
      "comments": {
        "none": [
          {
            "comment": "Allow the maximum number of active tile requests to be modified at run-time."
          },
          {
            "comment": "Fix excessive memory consumption by polyline graphics."
          },
          {
            "comment": "merge"
          },
          {
            "comment": "Enable path interpolation"
          },
          {
            "comment": "Enable schedule animation"
          },
          {
            "comment": "if view delta is too large or small, set it to max/min rather than aborting viewing operations."
          },
          {
            "comment": "Fix transform order when pushing branch."
          },
          {
            "comment": "Implement quaternion interpolation for Synchro schedule animation"
          },
          {
            "comment": "remove trash files"
          },
          {
            "comment": "Add batch feature overrides to optimize schedule animation."
          },
          {
            "comment": "Prioritize tile requests based on tile type and depth."
          },
          {
            "comment": "Improve performance by limiting the number of simultaneously-active tile requests."
          }
        ]
      }
    },
    {
      "version": "0.179.0",
      "tag": "@bentley/imodeljs-frontend_v0.179.0",
      "date": "Wed, 19 Dec 2018 18:26:14 GMT",
      "comments": {
        "none": [
          {
            "comment": "Added showDialogInitially support to ActivityMessageDetails"
          },
          {
            "comment": "View tools enhancement to use background map plane for depth point when geometry isn't identified."
          },
          {
            "comment": "Fix regression in the display of reality models induced by switch to OIDC for access token."
          },
          {
            "comment": "Support Pre animation tiles"
          },
          {
            "comment": "Add support for Syncro schedules (transform disabled)"
          }
        ]
      }
    },
    {
      "version": "0.178.0",
      "tag": "@bentley/imodeljs-frontend_v0.178.0",
      "date": "Thu, 13 Dec 2018 22:06:10 GMT",
      "comments": {
        "none": [
          {
            "comment": "Fix view becoming black in some circumstnces when locate cursor exits viewport."
          },
          {
            "comment": "Only make createGraphicBuilder available to DecorationContext. DynamicsContext/SceneContext require a scene graphic."
          },
          {
            "comment": "Added StringGetter support to ItemDefBase, ItemProps & ToolButton. Added IModelApp.i18n checks to Tool for unit tests."
          },
          {
            "comment": "Fix failure to locate elements if their transparency is overridden."
          },
          {
            "comment": "Added tool prompts. Fix dynamics changing locate circle. Hide touch cursor on mouse motion."
          }
        ]
      }
    },
    {
      "version": "0.177.0",
      "tag": "@bentley/imodeljs-frontend_v0.177.0",
      "date": "Wed, 12 Dec 2018 17:21:31 GMT",
      "comments": {
        "none": [
          {
            "comment": "Added TwoWayViewportSync class to connect two Viewports so that changes to one are reflected in the other."
          },
          {
            "comment": "Renamed ViewStateData to ViewStateProps and ViewState.createFromStateData to ViewState.createFromProps."
          },
          {
            "comment": "turn off locate circle when mouse leaves a view"
          }
        ]
      }
    },
    {
      "version": "0.176.0",
      "tag": "@bentley/imodeljs-frontend_v0.176.0",
      "date": "Mon, 10 Dec 2018 21:19:45 GMT",
      "comments": {
        "none": [
          {
            "comment": "Move cursors and sprites to separate directories"
          },
          {
            "comment": "Fix bug in which the frustum of a spatial view was always expanded to include the ground plane even if the ground plane was not displayed."
          },
          {
            "comment": "Ignore 2d models in model selectors."
          },
          {
            "comment": "Add tracking of active + pending tile requests."
          }
        ]
      }
    },
    {
      "version": "0.175.0",
      "tag": "@bentley/imodeljs-frontend_v0.175.0",
      "date": "Mon, 10 Dec 2018 17:08:55 GMT",
      "comments": {
        "none": [
          {
            "comment": "route map tiles over https"
          }
        ]
      }
    },
    {
      "version": "0.174.0",
      "tag": "@bentley/imodeljs-frontend_v0.174.0",
      "date": "Mon, 10 Dec 2018 13:24:09 GMT",
      "comments": {
        "none": [
          {
            "comment": "Touch tap with AccuSnap enabled now brings up a decoration planchette to help choose the snap point."
          }
        ]
      }
    },
    {
      "version": "0.173.0",
      "tag": "@bentley/imodeljs-frontend_v0.173.0",
      "date": "Thu, 06 Dec 2018 22:03:29 GMT",
      "comments": {
        "none": [
          {
            "comment": "map api cors fix"
          },
          {
            "comment": "Fix failure to display Bing maps logo."
          },
          {
            "comment": "Fix \"maximum window\" error when viewing large drawings."
          },
          {
            "comment": "enable tslint rules for asyncs"
          },
          {
            "comment": "T"
          },
          {
            "comment": "Custom imodelJs noDirectImport lint rule implemented, noDuplicateImport lint rule turned on."
          }
        ]
      }
    },
    {
      "version": "0.172.0",
      "tag": "@bentley/imodeljs-frontend_v0.172.0",
      "date": "Tue, 04 Dec 2018 17:24:39 GMT",
      "comments": {
        "none": [
          {
            "comment": "Changed index file name to match package name. Change imports to use other packages' index file."
          }
        ]
      }
    },
    {
      "version": "0.171.0",
      "tag": "@bentley/imodeljs-frontend_v0.171.0",
      "date": "Mon, 03 Dec 2018 18:52:58 GMT",
      "comments": {
        "none": [
          {
            "comment": "WIP: add support for schedule animation (symbology)."
          },
          {
            "comment": "geometry coverage"
          },
          {
            "comment": "geometry coverage"
          },
          {
            "comment": "Fix incorrect length used to create Uint32Array from Uint8Array."
          },
          {
            "comment": "Fix incorrect display of raster text."
          },
          {
            "comment": "Fix bug in which the frustum of a spatial view was always expanded to include the ground plane even if the ground plane was not displayed."
          },
          {
            "comment": "Fix exception when attempting to create a SubCategoryAppearance from an empty string."
          },
          {
            "comment": "Locate circle should be initialized to off."
          },
          {
            "comment": "Enable locate and hilite for point clouds."
          },
          {
            "comment": "Rename SimpleViewTest to display-test-app"
          },
          {
            "comment": "SnapStatus and LocateFailure cleanup"
          },
          {
            "comment": "Front end \"read pixels\" can now provide subCategoryId and GeometryClass to backend."
          },
          {
            "comment": "Check SubCategoryAppearance dontLocate and dontSnap now that HitDetail has subCategoryId."
          }
        ]
      }
    },
    {
      "version": "0.170.0",
      "tag": "@bentley/imodeljs-frontend_v0.170.0",
      "date": "Mon, 26 Nov 2018 19:38:42 GMT",
      "comments": {
        "none": [
          {
            "comment": "Fix missing uniform error in Edge browser."
          },
          {
            "comment": "Optimize 'pick buffer' portion of renderer."
          }
        ]
      }
    },
    {
      "version": "0.169.0",
      "tag": "@bentley/imodeljs-frontend_v0.169.0",
      "date": "Tue, 20 Nov 2018 16:17:15 GMT",
      "comments": {}
    },
    {
      "version": "0.168.0",
      "tag": "@bentley/imodeljs-frontend_v0.168.0",
      "date": "Sat, 17 Nov 2018 14:20:11 GMT",
      "comments": {}
    },
    {
      "version": "0.167.0",
      "tag": "@bentley/imodeljs-frontend_v0.167.0",
      "date": "Fri, 16 Nov 2018 21:45:44 GMT",
      "comments": {
        "none": [
          {
            "comment": "Add support for finding reality models that overlap project extent."
          },
          {
            "comment": "Refactor ContextRealityModelState"
          },
          {
            "comment": "Numerous shader program optimizations."
          }
        ]
      }
    },
    {
      "version": "0.166.0",
      "tag": "@bentley/imodeljs-frontend_v0.166.0",
      "date": "Mon, 12 Nov 2018 16:42:10 GMT",
      "comments": {
        "none": [
          {
            "comment": "Hydrated briefcases for ReadOnly cases from the latest checkpoint, rather than the seed files. This significantly improves performance of IModelDb/IModelConnection.open() for typical cases. "
          }
        ]
      }
    },
    {
      "version": "0.165.0",
      "tag": "@bentley/imodeljs-frontend_v0.165.0",
      "date": "Mon, 12 Nov 2018 15:47:00 GMT",
      "comments": {
        "none": [
          {
            "comment": "Fix SelectionSet broadcasting excessive selection change events"
          },
          {
            "comment": "Add support for Context Reality Models"
          }
        ]
      }
    },
    {
      "version": "0.164.0",
      "tag": "@bentley/imodeljs-frontend_v0.164.0",
      "date": "Thu, 08 Nov 2018 17:59:20 GMT",
      "comments": {
        "none": [
          {
            "comment": "AccuDraw/AccuSnap markdown/examples"
          },
          {
            "comment": "Fix edge animation of PolyfaceAuxData"
          },
          {
            "comment": "Updated frontend performance testing"
          },
          {
            "comment": "Change filterHit on InteractiveTool to async to support backend queries"
          },
          {
            "comment": "Fix JSON representation of DisplayStyleState."
          },
          {
            "comment": "Fix links in tool docs"
          },
          {
            "comment": "Added an option to Viewport.readImage() to flip the resultant image vertically."
          },
          {
            "comment": "PrimitiveTool isValidLocation shouldn't require write, want check for measure tools too"
          },
          {
            "comment": "Add Comments"
          },
          {
            "comment": "Updated to TypeScript 3.1"
          }
        ]
      }
    },
    {
      "version": "0.163.0",
      "tag": "@bentley/imodeljs-frontend_v0.163.0",
      "date": "Wed, 31 Oct 2018 20:55:37 GMT",
      "comments": {
        "none": [
          {
            "comment": "Get snap sprites and view cursors from a url"
          },
          {
            "comment": "Move filterHit from PrimitveTool to InteractiveTool. PrimitiveTool docs."
          },
          {
            "comment": "Support conversion of ImageBuffer to PNG."
          },
          {
            "comment": "PrimitiveTool cursor fixes and wip markdown"
          },
          {
            "comment": "Hide WIP ChangeCache methods on IModelConnection"
          }
        ]
      }
    },
    {
      "version": "0.162.0",
      "tag": "@bentley/imodeljs-frontend_v0.162.0",
      "date": "Wed, 24 Oct 2018 19:20:06 GMT",
      "comments": {
        "none": [
          {
            "comment": "Added view decoration examples to docs."
          },
          {
            "comment": "Make ToolAdmin.defaultTool. public. Allow getToolTip to return HTMLElement | string."
          },
          {
            "comment": "Fix clipping planes with large floating point values for iOS."
          },
          {
            "comment": "Breaking changes to optimize usage of 64-bit IDs."
          },
          {
            "comment": "Avoid small allocations within render loop."
          },
          {
            "comment": "Added NotificationManager.isToolTipSupported so that we can avoid asking for tooltip message when _showToolTip isn't implemented by application."
          }
        ]
      }
    },
    {
      "version": "0.161.0",
      "tag": "@bentley/imodeljs-frontend_v0.161.0",
      "date": "Fri, 19 Oct 2018 13:04:14 GMT",
      "comments": {}
    },
    {
      "version": "0.160.0",
      "tag": "@bentley/imodeljs-frontend_v0.160.0",
      "date": "Wed, 17 Oct 2018 18:18:38 GMT",
      "comments": {}
    },
    {
      "version": "0.159.0",
      "tag": "@bentley/imodeljs-frontend_v0.159.0",
      "date": "Tue, 16 Oct 2018 14:09:09 GMT",
      "comments": {}
    },
    {
      "version": "0.158.0",
      "tag": "@bentley/imodeljs-frontend_v0.158.0",
      "date": "Mon, 15 Oct 2018 19:36:09 GMT",
      "comments": {}
    },
    {
      "version": "0.157.0",
      "tag": "@bentley/imodeljs-frontend_v0.157.0",
      "date": "Sun, 14 Oct 2018 17:20:06 GMT",
      "comments": {
        "none": [
          {
            "comment": "Fixing scripts for linux"
          }
        ]
      }
    },
    {
      "version": "0.156.0",
      "tag": "@bentley/imodeljs-frontend_v0.156.0",
      "date": "Fri, 12 Oct 2018 23:00:10 GMT",
      "comments": {
        "none": [
          {
            "comment": "Initial release"
          }
        ]
      }
    }
  ]
}
